app/views/shared/_footer.html.erb

        <ul>
        <% Category.all.each do |category| %>
---
SELECT `categories`.* FROM `categories`