app/views/shared/_navbar.html.erb

SELECT `categories`.* FROM `categories`
---
          <ul class="dropdown-menu" role="menu">
          <% Category.all.each do |category| %>