app/controllers/posts_controller.rb

SELECT  `posts`.* FROM `posts` WHERE (tag like '%tablice%')  ORDER BY updated_at DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM `posts` WHERE (tag like '%tablice%')
SELECT  `posts`.* FROM `posts`  ORDER BY created_at DESC LIMIT 6 OFFSET 0
---
  def index
  	if params[:search]
  	  @posts = Post.search(params[:search]).order("updated_at DESC").page(params[:page]).per(6)
    else
      @posts = Post.order("created_at DESC").page(params[:page]).per(6)