app/views/categories/show.html.erb

SELECT `posts`.* FROM `posts` WHERE `posts`.`category_id` = 1
---
    <tbody>
    <% @category.posts.each do |post| %>